<?php

$num1 = 12;
$num2 = 7;

// the hard way

// echo $num1.' * '.$num2.' = '.$num1*$num2;

// if (($num1 % 2) == 0 && ($num2 % 2) == 0) {
// 	echo '_Произведението на числата е четно число';
// } else if (($num1 % 2) != 0 && ($num2 % 2) != 0) {
// 	echo '_Произведението на числата е нечетно число';
// } else {
// 	echo '_Произведението на числата е нечетно число';
// }

//the easy way

echo $num1.' * '.$num2.' = '.$num1*$num2;
$result = $num1 * $num2;
if (($result % 2) == 0) {
	echo '_Произведението на числата е четно число';
} else {
	echo '_Произведението на числата е нечетно число';
}