<?php
$news = [
		['heading' => 'В Свищов започнаха Алековите дни', 'date' => '10.01.19', 'content' => 'Отбелязването на Алековите дни започва през 1966 година по инициатива на вестник „Народна младеж“ и продължава до 1989 година.'],
		['heading' => 'Добавка в колбасите и газираните напитки предизвиква мързел', 'date' => '5.01.19', 'content' => 'Специалисти от Тексаския университет са установили в изследвания с мишки и хора неблагоприятните ефекти от прекомерния прием на фосфат - често консумирана добавка в западната диета.'],
		['heading' => 'Градче беше нападнато от тюлени', 'date' => '10.01.19', 'content' => 'Градчето Родиктън Байд-Арм в северната част на остров Нюфаундленд потърси помощ от бреговата охрана на Канада заради инвазията на около 40 тюлена, които се разхождат по улиците и в градините, тъй като не успели да се върнат в Атлантическия океан, предаде Франс прес.'],
		['heading' => 'Какво ви очаква през 2019-а според личното число?', 'date' => '5.01.19', 'content' => 'Нумерологията е древна наука за числата и ни дава възможност да определим направлението на тези събития, които ни очакват. В нумерологията всяка година носи определена вибрация, която може да бъде положителна или отрицателна.'],
		['heading' => 'Куркумата усилва паметта с 28%', 'date' => '7.01.19', 'content' => 'Индийската подправка куркума, която е ключова за източната кухня, усилва паметта и подобрява настроението, откри ново изследване, пише списание "Обекти".'],
		['heading' => 'Учени оспориха "ефекта на Мона Лиза"', 'date' => '3.01.19', 'content' => 'Макар и хората да смятат, че Мона Лиза от шедьовъра на Леонардо следи посетителите с очи, германски учени твърдят, че това е само психологически ефект, съобщи в. "Мирър".'],
		['heading' => 'Хавайски вулкан създаде изумителен черен плаж', 'date' => '10.01.19', 'content' => 'През май 2018 г. вулканът Килауеа, разположен на остров Хавай, изригна, причинявайки сериозни разрушения в района.']
		];
?>
<!DOCTYPE html>
<html lang="bg">
<head>
	<title>PHP работа със стрингове - домашно</title>
</head>
<body>
	<?php
	for ($i = count($news)-5; $i < count($news); $i++) {
		echo '<h3>'.$news[$i]['heading'].'</h3>';
		echo '<div>'.$news[$i]['date'].'</div>';
		echo '<p>'.mb_substr($news[$i]['content'], 0, 60).'...'.'</p>';
		echo '<br>';
	}
	?>
</body>
</html>